Python 3.14.2 (tags/v3.14.2:df79316, Dec  5 2025, 17:01:40) [MSC v.1944 32 bit (Intel)] on win32
Enter "help" below or click "Help" above for more information.
>>> a=input("请输入第一个数字")
请输入第一个数字
>>> b=input("请输入第二个数字")
请输入第二个数字
>>> 
============================================================= RESTART: C:/Users/姜迎春/Downloads/shuzi.py =============================================================
9
>>> heros=["蜘蛛侠","绿巨人","黑寡妇","鹰眼","灭霸","雷神"]
>>> heros[4]="钢铁侠"
>>> heros
['蜘蛛侠', '绿巨人', '黑寡妇', '鹰眼', '钢铁侠', '雷神']
>>> nums=[3,1,9,6,8,3,5,3]
>>> nums.sort()
>>> nums
[1, 3, 3, 3, 5, 6, 8, 9]
>>> nums.reverse()
>>> nums
[9, 8, 6, 5, 3, 3, 3, 1]
>>> heros.reverse()
>>> heros
['雷神', '钢铁侠', '鹰眼', '黑寡妇', '绿巨人', '蜘蛛侠']
>>> nums=[5,8,3,5,7,9,5,2]
>>> nums.sort()
>>> 
>>> nums
[2, 3, 5, 5, 5, 7, 8, 9]
>>> nums.reverse()
>>> 
>>> nums
[9, 8, 7, 5, 5, 5, 3, 2]
