slang_dict={}
slang_dict["腼腆"]="内向、害羞、不善主动表达，在社交中容易拘谨、放不开，在意他人看法，习惯低调内敛，不太擅长应对陌生场合和多人注视。"
slang_dict["乐观"]="对事物总往积极方向看待，心态轻松豁达，相信困难终会过去，遇事不钻牛角尖，充满希望与活力"
slang_dict["开朗"]="性格外向爽快，爱说爱笑，待人热情大方，不扭捏、不计较，社交轻松自在，情绪积极外露。"
slang_dict["悲观"]="习惯往坏处预想，对未来缺乏信心，容易焦虑消极，遇事易放大困难，总担心事情走向不好的结果。"
slang_dict["谄媚"]="刻意讨好、奉承他人，姿态卑微，曲意迎合，为了利益或好感而过分恭维、丧失原则。"
slang_dict["蛮横"]="态度粗暴强势，不讲道理，行事霸道，不顾及他人感受，习惯用强硬方式压人。"
answer=input("请输入你想查询的性格：")
if answer in slang_dict:
    print("您查询的"+answer+"含义如下")
    print(slang_dict[answer])
else:
    print("您查询的性格暂时未收入")
    print("当前收入的性格词条为"+str(len(slang_dict))+"条")
